Repository: nape-max/learn-gdscript-translations
Catalog: */lesson-17-while-loops.po
Languages: pl

source: You've seen that you can use functions to [i]reuse[/i] code. In this lesson, you'll learn about [b]loops[/b]. Loops help you [i]repeat[/i] code. To illustrate how loops work, let's take a game board split into a grid. Our robot can move to neighboring cells by changing a [code]Vector2[/code] variable named [code]cell[/code]. It represents the current cell the robot is in. When we increase [code]cell.x[/code], the robot moves to the right. Note that we delay the robot's movement in the app to help you visualize how it moves. The following code would normally move the robot instantly.
pl: Widziałeś już, że możesz używać funkcji do \[i]ponownego wykorzystania\[/i] kodu. W tej lekcji poznasz \[b]pętle\[/b]. Pętle pomagają \[i]powtarzać\[/i] kod. Aby zilustrować działanie pętli, spójrzmy na planszę podzieloną na siatkę. Nasz robot może poruszać się do sąsiednich pól, zmieniając zmienną \[code]Vector2\[/code] o nazwie \[code]cell\[/code]. Reprezentuje ona aktualne pole, na którym znajduje się robot. Gdy zwiększymy \[code]cell.x\[/code], robot przesuwa się w prawo. Zauważ, że w aplikacji opóźniamy ruch robota, aby pomóc ci zwizualizować, jak się porusza. Normalnie poniższy kod spowodowałby, że robot przemieści się natychmiast.

source: We can move diagonally by adding a [code]Vector2[/code] directly.
pl: Możemy poruszać się po przekątnej, dodając bezpośrednio \[code]Vector2\[/code].

source: The above code works for a pre-defined board with a size of [code]Vector2(3, 3)[/code], but the [code]move_to_end()[/code] function wouldn't work if the size of the board was different. The robot would either stop before the end or go too far. To implement a general solution for all board sizes, we can repeat the robot's movement until it gets to the end. For code that repeats, we can use [i]loops[/i].
pl: Powyższy kod działa dla z góry określonej planszy o rozmiarze \[code]Vector2(3, 3)\[/code], ale funkcja \[code]move\_to\_end()\[/code] nie zadziała, jeśli rozmiar planszy będzie inny. Robot albo zatrzyma się przed końcem, albo posunie się za daleko. Aby zaimplementować rozwiązanie ogólne dla wszystkich rozmiarów planszy, możemy powtarzać ruch robota, aż dotrze do końca. Do kodu, który się powtarza, możemy użyć \[i]pętli\[/i].

source: Using while loops to repeat code
pl: Używanie pętli **while** do powtarzania kodu

source: You can use a [code]while[/code] loop to make the computer repeat a block of code until you meet a specific condition or decide to break from the loop. Here's how we use a [code]while[/code] loop.
pl: Możesz użyć pętli \[code]while\[/code], aby komputer powtarzał blok kodu, dopóki nie zostanie spełniony określony warunek lub dopóki nie zdecydujesz się przerwać pętli. Oto, jak korzystamy z pętli \[code]while\[/code].

source: We use the variable [code]number[/code] to keep track of how many loops the [code]while[/code] loop completes. Each time we go through the [code]while[/code] loop, we add [code]1[/code] to [code]number[/code]. The [code]while[/code] loop keeps running for as long as the condition is true. In this case, it keeps running while [code]number[/code] is less than [code]4[/code]. You can see that the following code is executed four times in the console.
pl: Używamy zmiennej [code]number[/code] do śledzenia ile razy pętla [code]while[/code] wykonuje się. Za każdym razem gdy przechodzimy przez pętlę [code]while[/code], dodajemy [code]1[/code] do [code]number[/code]. Pętla [code]while[/code] działa tak długo, jak długo warunek jest prawdziwy. W tym przypadku działa dopóki [code]number[/code] jest mniejsze niż [code]4[/code]. Możesz zobaczyć, że następujący kod jest wykonywany cztery razy w konsoli.Używamy zmiennej [code]number[/code] do śledzenia ile razy pętla [code]while[/code] wykonuje się. Za każdym razem gdy przechodzimy przez pętlę [code]while[/code], dodajemy [code]1[/code] do [code]number[/code]. Pętla [code]while[/code] działa tak długo, jak długo warunek jest prawdziwy. W tym przypadku działa dopóki [code]number[/code] jest mniejsze niż [code]4[/code]. Możesz zobaczyć, że następujący kod jest wykonywany cztery razy w konsoli.

source: Let's apply this to our [code]move_to_end()[/code] function. This time, we compare the number of loops to the board's width. We go through the loop until we reach the width of the board. Note that we move the robot until its position is one less than the board's width because we are counting tiles from [code]0[/code]. A board of [code]3[/code] by [code]3[/code] cells would have cell coordinates going from [code]0[/code] to [code]2[/code] on both the X and Y axes.
pl: Zastosujmy to do naszej funkcji [code]move_to_end()[/code]. Tym razem porównujemy liczbę powtórzeń pętli z szerokością planszy. Przechodzimy przez pętlę, dopóki nie osiągniemy szerokości planszy. Zauważ, że przesuwamy robota aż do momentu, gdy jego pozycja jest o jeden mniejsza od szerokości planszy, ponieważ liczymy pola od [code]0[/code]. Plansza o wymiarach [code]3[/code] na [code]3[/code] pola miałaby współrzędne od [code]0[/code] do [code]2[/code] zarówno na osi X, jak i na osi Y.

source: While loops can cause issues
pl: Pętle while mogą powodować problemy

source: If you're not careful, your [code]while[/code] loop can run infinitely. In that case, the application will freeze. Take a look at this code example.
pl: Jeśli nie będziesz ostrożny, twoja pętla [code]while[/code] może działać w nieskończoność. W takim wypadku aplikacja się zawiesi. Spójrz na ten przykład kodu.

source: What would happen if the computer tried to run the code above?
pl: Co by się stało, gdyby komputer próbował uruchomić powyższy kod?

source: Because we don't increment [code]number[/code] within the [code]while[/code] loop, it always stays at [code]0[/code]. As a result, the number is always lower than [code]10[/code], so we never break out of the loop. Since there's no way to exit the [code]while[/code] loop, the computer will attempt to draw squares infinitely, which will freeze the program. When programs stop responding on your computer, it's often due to an infinite loop!
pl: Ponieważ nie zwiększamy wartości [code]number[/code] w pętli [code]while[/code], zawsze pozostaje ona równa [code]0[/code]. W rezultacie liczba zawsze jest mniejsza niż [code]10[/code], więc nigdy nie wychodzimy z pętli. Ponieważ nie ma sposobu, aby opuścić pętlę [code]while[/code], komputer będzie próbował rysować kwadraty w nieskończoność, co spowoduje zawieszenie programu. Kiedy programy przestają odpowiadać na twoim komputerze, często jest to spowodowane nieskończoną pętlą!

source: It would draw squares infinitely until the program is terminated
pl: Rysowałoby kwadraty w nieskończoność, aż program zostanie zakończony

source: Introduction to While Loops
pl: Wprowadzenie do pętli while
